## 算法

### 并查集

- 解决连通性问题：

  1. 将两个元素添加到同一个集合中
  2. 判断两个元素是否在同一个集合中

- 关键方法：

  1. join(u,v): 将uv这条边加入并查集
  2. find(u): 寻找u的根节点
  3. init(): 初始化并查集，每个元素的根节点都是自己本身
  4. isSame(u,v): 判断是否有uv边，即u、v是否在同一个集合中

- 优化：

  路径压缩：不做优化的情况下，find可能需要递归好几层才能找到根节点，如果在递归的过程中重新设置每个元素的父节点，都将自己指向父结点的边改为指向原来的根节点，这样就可以把树的高度减为2，大大降低了递归深度

  由

  <img src="https://code-thinking-1253855093.file.myqcloud.com/pics/20230602102619.png" alt="img" style="zoom: 50%;" />

变成

<img src="https://code-thinking-1253855093.file.myqcloud.com/pics/20230602103040.png" alt="img" style="zoom: 67%;" />



代码：

```cpp
class UnionSet
{
public:
    UnionSet(int size)
    {
        size_ = size;
        father = vector<int>(size, 0);
        // 初始化，元素都指向自己本身
        for (int i = 0; i < size_; i++)
        {
            father[i] = i;
        }
    }

    // 查找u的根元素并且路径压缩
    int find(int u)
    {
        return u == father[u] ? u : father[u] = find(father[u]);
    }

    // 合并两个元素所在集合
    void join(int u, int v)
    {
        // 找到两个元素的根元素，然后合并两棵树，这样相当于在同一个集合里了
        u = find(u);
        v = find(v);
        // 已经在同一个集合就不需要再次合并了
        if (u == v)
            return;

        father[v] = u;
    }

    // 判断两个元素是否在同一个集合中
    bool isSame(int u, int v)
    {
        // 根元素相同就代表在同一个集合中
        return find(u) == find(v);
    }

private:
    int size_;
    vector<int> father;
};
```







### 排序算法

```cpp
#include <iostream>
#include <vector>
using namespace std;

// 冒泡排序：将大数像泡泡一样冒到最后（稳定）
void bubbleSort(vector<int>& vec)

- 平台原因(移植原因)：不是所有的硬件平台都能访问任意地址上的任意数据的；某些硬件平台只能在某些地址处取某些特定类型的数据，否则抛出硬件异常。

- 性能原因：数据结构(尤其是栈)应该尽可能地在自然边界上对齐。原因在于，为了访问未对齐的内存，处理器需要作两次内存访问；而对齐的内存访问仅需要一次访问。

  假如没有内存对齐机制，数据可以任意存放，现在一个int变量存放在从地址1开始的联系四个字节地址中，该处理器去取数据时，要先从0地址开始读取第一个4字节块,剔除不想要的字节（0地址）,然后从地址4开始读取下一个4字节块,同样剔除不要的数据（5，6，7地址）,最后留下的两块数据合并放入寄存器。这需要做很多工作。
  现在有了内存对齐的，int类型数据只能存放在按照对齐规则的内存中，比如说0地址开始的内存。那么现在该处理器在取数据时一次性就能将数据读出来了，而且不需要做额外的操作，提高了效率。





### 纯虚函数、虚函数、虚函数表

https://zhuanlan.zhihu.com/p/75172640

https://zhuanlan.zhihu.com/p/270614081





**纯虚函数**

定义一个函数为虚函数，不代表函数为不被实现的函数。

定义他为虚函数是为了允许用基类的指针来调用子类的这个函数。

定义一个函数为纯虚函数，才代表函数没有被实现。

定义纯虚函数是为了实现一个接口，起到一个规范的作用，继承该类的派生类必须实现该函数



何时使用纯虚函数：

（1）当想在基类中抽象出一个方法，且该基类只做能被继承，而不能被实例化；

（2）这个方法必须在派生类(derived class)中被实现；

  如果满足以上两点，可以考虑将该方法申明为纯虚函数.

`一个类如果有纯虚函数，那么它就是抽象类，不能被实例化`



**虚函数、虚函数表**

虚函数：被virtual修饰的类成员函数

每个包含了虚函数的类都包含了一张虚函数表

当一个类（A）继承另一个类（B）时，类A会继承类B的函数的调用权。所以如果一个基类包含了虚函数，那么其继承类也可调用这些虚函数，换句话说，一个类继承了包含虚函数的基类，那么这个类也拥有自己的虚表。



```cpp
// 类A包含虚函数vfunc1，vfunc2，由于类A包含虚函数，故类A拥有一个虚表。
class A {
public:
    virtual void vfunc1();
    virtual void vfunc2();
    void func1();
    void func2();
private:
    int m_data1, m_data2;
};
```

<img src="https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240318203825639.png" alt="image-20240318203825639" style="zoom:150%;" />



虚表是一个指针数组，其元素是虚函数的指针，每个元素对应一个虚函数的函数指针。需要指出的是，普通的函数即非虚函数，其调用并不需要经过虚表，所以虚表的元素并不包括普通函数的函数指针。
虚表内的条目，即虚函数指针的赋值发生在编译器的编译阶段，也就是说在代码的编译阶段，虚表就可以构造出来了。



> 虚表是属于类的，而不是属于某个具体的对象，一个类只需要一个虚表即可。同一个类的所有对象都使用同一个虚表。

为了指定对象的虚表，对象内部包含一个虚表的指针，来指向自己所使用的虚表。为了让每个包含虚表的类的对象都拥有一个虚表指针，编译器在类中添加了一个指针，`*__vptr`，用来指向虚表。这样，当类的对象在创建时便拥有了这个指针，且这个指针的值会自动被设置为指向类的虚表。

<img src="https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240318205416612.png" alt="image-20240318205416612" style="zoom:150%;" />



**子类的虚表**

```cpp
class A {
public:
    virtual void vfunc1();
    virtual void vfunc2();
    void func1();
    void func2();
private:
    int m_data1, m_data2;
};
class B : public A {
public:
    virtual void vfunc1();
    void func1();
private:
    int m_data3;
};
class C: public B {
public:
    virtual void vfunc2();
    void func2();
private:
    int m_data1, m_data4;
};
```

类A是基类，类B继承类A，类C又继承类B。类A，类B，类C，其对象模型如下图所示。

![image-20240318205547970](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240318205547970.png)

`对象的虚表指针用来指向自己所属类的虚表，虚表中的指针会指向其继承的最近的一个类的虚函数`



```cpp
int main() 
{
    B bObject;
    A *p = & bObject;
    p->vfunc1();
}
```

![image-20240318210458446](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240318210458446.png)





示例代码：

```cpp
#include<iostream>
using namespace std;

class Base {
public:
	Base(){}
	virtual ~Base(){}
	virtual void func() {
		cout << "base func" << endl;
	}
};

class Derived :public Base {
public:
	Derived(){}
	virtual ~Derived(){}
	virtual void func() {
		cout << "derived func" << endl;
	}
	virtual void func2() {};
};

int main() {}
```



`Derived类内存分布`

一个对象所占内存是其所有成员属性所占内存的总和内存对齐后的大小，如果有虚函数的话还要在加上虚函数表指针

一个派生类所占内存包括它所有的基类大小加上它自己的成员属性的总和内存对齐后的大小，如果如果有虚函数的话还要再加上虚函数表指针

```
1>class Base	size(8):
1>	+---
1> 0	| {vfptr}
1>	+---
1>Base::$vftable@:
1>	| &Base_meta
1>	|  0
1> 0	| &Base::{dtor}
1> 1	| &Base::func

===================================================================================================================

1>class Derived	size(8):
1>	+---
1> 0	| +--- (base class Base)
1> 0	| | {vfptr}
1>	| +---
1>	+---
1>Derived::$vftable@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::{dtor}
1> 1	| &Derived::func
1> 2	| &Derived::func2
```

`派生类是从基类继承的虚函数表，就像继承其它成员属性一样，派生类不会再自己生成一张虚函数表，而对于派生类的虚函数，会在虚函数表中对应位置修改或添加虚函数指针，但虚函数是派生类独有(基类没有)时，会添加到该虚函数表中`

### extern

如果想在多个文件之间共享const变量，必须在变量的定义前加上extern关键字



### const限定符

![image-20240319210655314](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240319210655314.png)





### 无符号与有符号的比较

![image-20240320134747641](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320134747641.png)



### 字符串相加

![image-20240320135448633](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320135448633.png)

![image-20240320135506201](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320135506201.png)



### 迭代器

vector的rbegin()方法会返回一个反向迭代器指向最后一个元素，该迭代器执行++操作会往前面移动一个元素

it->func() = (*it).func()



### 数组

![image-20240320144822974](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320144822974.png)



![image-20240320145742474](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320145742474.png)



![image-20240320150054220](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320150054220.png)





### 显示转换

- static_cast

  ![image-20240320152952804](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320152952804.png)

- const_cast

  ![image-20240320153131766](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320153131766.png)

- reinterpret_cast

  ![image-20240320153225174](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320153225174.png)

- dynamic_cast

  `dynamic_cast`是四个强制类型转换操作符中最特殊的一个，因为它支持`运行时`识别指针和引用。用于`类继承层次间的指针或引用转换`主要用于**安全的向下转型**，至于向上转型本身就是安全的，因此没必要使用dynamic_cast

```cpp
#include <iostream>
using namespace std;

class MyClass
{
public:
    void foo() { cout << "Non-const foo" << endl; }
    void foo() const { cout << "Const foo" << endl; }
};

int main()
{
    int i, j;

    // static_cast
    double slope = static_cast<double>(j) / i;
    void *p = nullptr;
    double *dp = static_cast<double *>(p);

    // const_cast
    const MyClass obj;
    obj.foo();                        // 调用const版本的foo
    const_cast<MyClass &>(obj).foo(); // 通过const_cast调用非const版本的foo

    // reinterpret_cast
    int *ip;
    char *pc = reinterpret_cast<char *>(ip);

    return 0;
}
```



### try语句块和异常处理

![image-20240320161334919](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320161334919.png)



![image-20240320181841608](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320181841608.png)



**寻找异常的处理代码过程**

![image-20240320182252095](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240320182252095.png)





### 万能引用、引用折叠、完美转发

**万能引用**

```cpp
void foo(int &&i){}; // i为右值引用

template <typename T>
void bar(T &&t) {} // t为万能引用

constexpr int get_val() { return 5; }
int &&x = get_val(); // x为右值引用
auto &&y = get_val(); // y为万能引用
```

右值引用只能绑定一个右值，而万能引用既能绑定左值，也能绑定右值



**引用折叠**

所谓的完能引用实际上是发生了类型推导，在这个推导的过程中，如果初始化的源对象是一个左值，则目标对象会推导出一个左值引用，反之如果源对象是一右值，则会推导出一个左值引用



引用折叠：C++11添加的一套引用叠加推导规则

有一个左值引用，那么最终类型就是左值引用（遇左则左）

![image-20240322190230326](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240322190230326.png)





万能引用+引用折叠用于实现完美转发，完美转发避免了额外的拷贝

一般来说，传个引用就可以避免拷贝了，但是由于引用是左值引用，所以当传入右值时就不行了。因此完美转发就实现了可以同时处理左值和右值



**完美转发**

示例代码：

```cpp
template<typename T>
void print(T & t){
    std::cout << "Lvalue ref" << std::endl;
}

template<typename T>
void print(T && t){
    std::cout << "Rvalue ref" << std::endl;
}

template<typename T>
void testForward(T && v){
    //虽然参数v是右值类型的，但此时v在内存中已经有了位置，所以v其实是个左值！
    print(v); //永远调用左值版本的print
    
    print(std::forward<T>(v)); //底层实际上就是static_cast<T&&>(v)
    
    print(std::move(v)); //永远调用右值版本的print

    std::cout << "======================" << std::endl;
}

int main(int argc, char * argv[])
{
    int x = 1;
    testForward(x); //实参为左值
    testForward(std::move(x)); //实参为右值
}
```

运行结果：

> ```text
> Lvalue ref
> Lvalue ref
> Rvalue ref
> /======================
> Lvalue ref
> Rvalue ref
> Rvalue ref
> /======================
> ```



本质问题在于无论是左值、右值在当作函数参数传递时，函数的参数在被使用时都会被当作左值，因为该参数在内存中已经有了位置


在STL中随处可见这种问题，C++11引入的emplace_back，它接受左值也接受右值作为参数，接着，它转调用construct函数，而construct函数转调用placement new，placement new根据传入的参数是左值还是右值再决定调用拷贝构造函数还是移动构造函数



`std::forward`实现如下：

```cpp
template <class T>
T&& forward(typename tinySTL::remove_reference<T>::type& t) noexcept {
    return static_cast<T&&>(t);
}

template <class T>
T&& forward(typename tinySTL::remove_reference<T>::type&& t) noexcept {
    return static_cast<T&&>(t);
}
```





### emplace_back和push_back

```cpp
#include <iostream>
#include <vector>
using namespace std;

class A
{
public:
    A() = default;
    A(const A &rhs)
    {
        cout << "copy constructor" << endl;
    }
    A(A &&rhs)
    {
        cout << "move constructor" << endl;
    }
};

int main(int argc, char *argv[])
{
    vector<A> vec;
    vec.reserve(20);
    A temp;
	
    // 虽然temp2是右值引用，但它实际上是一个左值
    A &&temp2 = move(temp);
    cout << &temp2 << "\n"
         << &temp << endl;

    // 调用的构造函数，调用的vector的方法
    vec.push_back(temp);               // copy , push_back(const value_type& __x)
    vec.push_back(std::move(temp));    // move , push_back(value_type&& __x)
    vec.push_back(A());                // move , push_back(value_type&& __x)
    vec.emplace_back(temp);            // copy , emplace_back(_Args&&... __args);
    vec.emplace_back(std::move(temp)); // move , emplace_back(_Args&&... __args);
    vec.emplace_back(A());             // move , emplace_back(_Args&&... __args);
}
```

运行结果：

> ```text
> 0x61fddf
> 0x61fddf
> copy constructor
> move constructor
> move constructor
> copy constructor
> move constructor
> move constructor
> ```





### 封装、继承和多态

`封装`

**定义：**将数据和操作数据的方法结合，隐藏对象的属性和实现细节，仅对外公开接口来和对象进行交互

**好处：**减少耦合、类内部的结构可以自由修改、更好控制类成员变量、隐藏属性和实现细节



`继承`

**定义：**可以使用已存在的类定义新类，新类可以定义新属性和新方法，但是不能选择性的继承父类的成员

**好处：**使用继承可以非常方便地复用之前的代码，大大提高开发效率

**多重继承：**一个派生类可以同时继承多个基类，由于可能会有成员命名冲突，因此对于同名成员，需要在前面加上类名和域解析符::



`多态`

**定义：**函数调用可以有多种形态

- 静态多态：函数重载
- 动态多态：基类指针或引用调用重写虚函数

**多态的构成条件：**

1. 必须通过基类的指针或引用调用虚函数
2. 被调用的函数必须是虚函数，且派生类重写了该虚函数

**好处：**

假设现在有一个基类，类型是人，在源代码中，会调用人的说话方法，这是一个虚函数，但人可以分为多个国家的人，每个国家的语言不一样，我们只需要继承基类人，然后重写对应的说话方法，就可以实现不用改动源代码，而是在运行时会根据基类指针或引用实际绑定的值来调用到对应的函数。这样大大降低了新添功能的复杂度



### STL容器释放

STL容器释放时，会调用元素的析构函数。**但是如果元素类型是指针时，并不会释放指针，需要我们先遍历容器一个个释放后，才能释放容器**，可以存放智能指针，而不是普通指针



### struct和class的区别

唯一区别就是默认访问权限，class默认访问权限是private，而struct是public



### 可变数据成员

const对象可以改变一个可变成员的值

![image-20240323234802597](https://md-jomo.oss-cn-guangzhou.aliyuncs.com/IMG/image-20240323234802597.png)



### 类的声明和定义

`在声明之后，定义之前，类为不完整类型，只能用于指向该类型的指针或引用或者用于声明（不是定义）使用该类型做为形参类型或者返回类型的函数。`





### 菱形继承与虚继承

`菱形继承的带来的问题`

类A和类B继承于同一个基类R，现在有一个类C同时继承类A和类B，此时类C的对象中会有两个同样的R，一份来自于A，另一份来自于B，这样会造成内存浪费。并且还会带来二义性

**示例代码**

```cpp
#include <iostream>
using namespace std;

class GrandParent
{
public:
    GrandParent()
    {
        cout << "GrandParent constructor" << endl;
    }
    GrandParent(int m_gp) : gp(m_gp) {}
    int gp;
};

class Father : public GrandParent
{
public:
    Father()
    {
        cout << "Father constructor" << endl;
    }
    Father(int m_father, int m_gp) : father(m_father) {}
    int father;
};

class Mother : public GrandParent
{
public:
    Mother()
    {
        cout << "Mother constructor" << endl;
    }
    Mother(int m_mother) : mother(m_mother) {}
    int mother;
};

class Son : public Father, public Mother
{
public:
    Son(int m_son)
    {
        son = m_son;
        cout << "Son constructor" << endl;
    }
    int son;
};

int main()
{
    // 生成一个son对象，由于是菱形继承，Father类和Mother类会各构造一次，而GrandParent会构造两次
    Son son(0);
    // 并且son使用GrandParent中的gp，还需要加上域解析符，不然会有二义性
    son.Father::gp;
    son.Mother::gp;
}
```

**输出结果**

> GrandParent constructor
> Father constructor 
> GrandParent constructor
> Mother constructor 
> Son constructor 



**Son内存分布**

```
1>class Son	size(20):
1>	+---
1> 0	| +--- (base class Father)
1> 0	| | +--- (base class GrandParent)
1> 0	| | | gp
1>	| | +---
1> 4	| | father
1>	| +---
1> 8	| +--- (base class Mother)
1> 8	| | +--- (base class GrandParent)
1> 8	| | | gp
1>	| | +---
1>12	| | mother
1>	| +---
1>16	| son
1>	+---
```



为了解决上述问题，引入了`虚基类`和`虚继承`

**虚基类：**在间接继承共同基类时只保留一份基类成员。虚基类不是在声明基类时声明的，是在声明派生类指定继承方式时，通过在继承方式前加`virtual`关键字

`对于具有共同基类的派生类最好采用虚继承的方式，避免多份基类成员的拷贝`

**虚继承：**在指定派生类继承方式前面加上`virtual`关键字



`C++编译系统只会执行最后的派生类对基类的初始化，而忽略其它派生类对虚基类的构造函数调用，从而避免对虚基类的同一成员多次初始化。因此虚基类只会构造一次，就是最后的派生类，在这里就是Son类，会执行GrandParent的构造函数，因为对于Son来说，GrandParent并不是虚基类`



**示例代码**

```cpp
#include <iostream>
using namespace std;

class GrandParent
{
public:
    GrandParent()
    {
        cout << "GrandParent constructor" << endl;
    }
    GrandParent(int m_gp) : gp(m_gp) {}
    int gp;
};

// Father是GrandParent的公用派生类，GrandParent是Father的虚基类
class Father : virtual public GrandParent
{
public:
    Father()
    {
        cout << "Father constructor" << endl;
    }
    Father(int m_father, int m_gp) : father(m_father) {}
    int father;
};

// Mother是GrandParent的公用派生类，GrandParent是Mother的虚基类
class Mother : virtual public GrandParent
{
public:
    Mother()
    {
        cout << "Mother constructor" << endl;
    }
    Mother(int m_mother) : mother(m_mother) {}
    int mother;
};

class Son : public Father, public Mother
{
public:
    Son(int m_son)
    {
        son = m_son;
        cout << "Son constructor" << endl;
    }
    int son;
};

int main()
{
    // 生成一个son对象，虽然间接继承了共同基类，但是只会有一份GrandParent成员
    Son son(0);
    // 直接访问gp，不具有二义性
    son.gp;
}
```

**输出结果**

> GrandParent constructor
> Father constructor
> Mother constructor
> Son constructor

**Son内存分布**

```
1>class Son	size(48):
1>	+---
1> 0	| +--- (base class Father)
1> 0	| | {vbptr}
1> 8	| | father
1>  	| | <alignment member> (size=4)
1>  	| | <alignment member> (size=4)
1>	| +---
1>16	| +--- (base class Mother)
1>16	| | {vbptr}
1>24	| | mother
1>  	| | <alignment member> (size=4)
1>  	| | <alignment member> (size=4)
1>	| +---
1>32	| son
1>  	| <alignment member> (size=4)
1>  	| <alignment member> (size=4)
1>	+---
1>	+--- (virtual base GrandParent)
1>40	| gp
1>	+---
```



### final和override

- `override`: 显示声明派生类要**重写虚函数**
- `final`: 
  - 修饰虚函数：显示声明该虚函数**不可被派生类重写**
  - 修饰类：显示声明该类**不可被继承**



## 数据结构

### 红黑树

性质：

1. 节点为红色或黑色
2. NIL节点(叶子节点)为黑色
3. 红色节点的子节点为黑色
4. 从根节点到NIL节点的每条路径上的黑色节点数量相同



### 智能指针

`智能指针的目的：`帮助我们自动释放指针

#### 共享指针内部实现

**智能指针类型：**

1. shared_ptr: 允许多个指针指向同一对象

   强引用计数：用来记录当前有多少个存活的 shared_ptrs 正持有该对象. 共享的对象会在最后一个强引用离开的时候销毁( 也可能释放)

   弱引用计数：用来记录当前有多少个正在观察该对象的 weak_ptrs. 当最后一个弱引用离开的时候, 共享的内部信息控制块会被销毁和释放 (共享的对象也会被释放, 如果还没有释放的话)

2. unique_ptr: “独占”所指向的对象

